const moment = require('moment-timezone');

module.exports.config = {
  name: "autotime2",
  version: "2.0.0",
  role: 0,
  author: "kylepogi",//don't change the author kung ayaw mong ma pwetan!! 
  description: "Automatically sends messages based on set times.",
  category: "AutoTime",
  countDown: 3
};

module.exports.onLoad = async ({ api }) => {
  const arrayData = {
     "12:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟮:𝟬𝟬 𝗣𝗠\n\n📍✨𝗜 𝘂𝗻𝗱𝗲𝗿𝘀𝘁𝗮𝗻𝗱 𝘆𝗼𝘂 𝘁𝗼 𝘀𝗲𝘆 𝗹𝗼𝘃𝗲, 𝘀𝗼 𝗶\n𝗳𝗶𝗻𝗱 𝘆𝗼𝘂 𝗮𝘀 𝗵𝘂𝗺𝗮𝗻 𝗽𝗲𝗮𝗰𝗲 𝗮𝘁 𝘁𝗵𝗲 𝗲𝗻𝗱 𝗼𝗳 𝘁𝗵𝗲 𝗱𝗲𝘆..!❤️‍🩹"
      },
      "01:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟭:𝟬𝟬 𝗔𝗠\n\n📍𝗠𝗮𝘆𝗯𝗲 𝗜𝗺 𝘁𝗼𝗼 𝗯𝗮𝗱 𝗯𝘂𝘁 𝘄𝗵𝗼 𝗸𝗻𝗼𝘄𝘀...!!🖤\n𝗛𝗲 𝘄𝗶𝗹𝗹 𝗼𝗻𝗹𝘆 𝗹𝗼𝗼𝗸 𝗳𝗼𝗿 𝗺𝗲..!! 😽✨"
      },
      "02:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟮:𝟬𝟬 𝗔𝗠\n\n📍 𝗔𝗷 𝗮𝗺𝗶 𝘀𝗼𝗯 𝗵𝗮𝗿𝗮𝗻𝗼\n𝗔𝗺𝗶 𝘀𝘂𝗻𝗼𝘁𝗮𝗶 𝗯𝗮𝘀𝗲 𝗵𝗮𝗵𝗮𝗸𝗮𝗿 𝗱𝗮𝗸𝗶 𝗹𝗮𝗴𝗲 𝗯𝗵𝗼𝘆♡<𝟯"

      },
      "03:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟯:𝟬𝟬 𝗔𝗠\n\n📍 𝘁𝗲𝗿𝗶 𝗻𝗮𝘇𝗿𝗼𝗻 𝗺𝗲𝗶𝗻 𝗵𝗮𝗶 𝘁𝗲𝗿𝗲 𝘀𝗮𝗽𝗻𝗲,\n𝘁𝗲𝗿𝗲 𝘀𝗮𝗽𝗻𝗼𝗻 𝗺𝗲𝗶𝗻 𝗵𝗮𝗶 𝗻𝗮𝗿𝗮𝗮𝘇𝗶♡<𝟯"
        
      },
      "04:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟰:𝟬𝟬 𝗔𝗠\n\n📍 𝗡𝗼𝗱𝗶𝗿 𝗼𝗽𝗮𝗿𝗲 𝗮𝗺𝗮𝗿 𝘀𝗵𝗼𝗽𝗻𝗼 𝗿𝗼𝗵𝗮𝗲 𝗴𝗮𝗰𝗲\n𝗧𝗼𝗯𝘂 𝗮𝗺𝗶 𝘁𝗼𝗿𝗶 𝗺𝗮𝗷𝗲..!♡<𝟯"

      },
      "05:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟱:𝟬𝟬 𝗔𝗠\n\n📍𝗧𝗼𝗺𝗮𝘆 𝗛𝗮𝗿𝗶𝗱 𝗠𝗮𝗷𝗮𝗿𝗲 𝗥𝗵𝗮𝗸𝗶𝗯𝗼\n𝗖𝗵𝗲𝗿𝗮 𝗗𝗶𝗯𝗼 𝗡𝗮𝗵♡<𝟯"
        
      },
      "06:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟲:𝟬𝟬 𝗔𝗠\n\n📍 𝗚𝗼𝗹𝗽𝗼 𝘁𝗮 𝗷𝗼𝗱𝗶 𝗯𝗵𝗮𝗹𝗼 𝗵𝗼𝗶 𝗸𝗵𝗼𝘁𝗶 𝗸𝗶\n𝗧𝗼𝗺𝗮𝗸𝗲 𝘁𝗼 𝗸𝗮𝗰𝗵𝗲 𝘁𝗵𝗮𝗸𝗲\n𝗱𝗮𝗸𝗵𝗲𝗰𝗶 𝗯𝗵𝗮𝗹𝗼𝗶 𝘁𝗼♡<𝟯"
        
      },
      "07:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟳:𝟬𝟬 𝗔𝗠\n\n📍 𝗕𝗵𝗮𝘀𝗲 𝗮𝘀𝗼 𝘁𝘂𝗺𝗶 𝗮𝗺𝗮𝗿𝗶 𝘀𝗵𝗼𝗽𝗼𝗻𝗲\n𝗮𝗱𝗵𝗮𝗿𝗲𝗿 𝗸𝗵𝗮𝗹𝗼 𝗼𝗻𝗱𝗼𝗸𝗮𝗿𝗲..!"
        
      },
      "08:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟴:𝟬𝟬 𝗔𝗠\n\n📍 𝗕𝗼𝗹𝗻𝗮 𝘁𝘂𝗶 𝗯𝗼𝗹𝗻𝗮 𝗯𝘂𝗹𝗲 𝗴𝗶𝘆𝗮 𝗰𝗵𝗼𝗹𝗼𝗻𝗮\n𝗼 𝗺𝗼𝗻 𝘁𝘂𝗶 𝗯𝗼𝗹𝗻𝗮\n𝗕𝗵𝗮𝗹𝗼𝗯𝗮𝘀𝗵𝗶 𝗯𝗼𝗹𝗻𝗮..!"
        
      },
      "09:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟵:𝟬𝟬 𝗔𝗠\n\n📍 𝗡𝗮\n𝗸𝗼𝗶 𝗵𝗲𝗶𝗻! 𝗡𝗮 𝗸𝗼𝗶 𝘁𝗵𝗮 𝗭𝗶𝗻𝗱𝗲𝗴𝗶\n𝗺𝗲𝗶𝗻 𝗸𝗵𝘂𝗱 𝗸 𝘀𝗶𝘄𝗮🩷🫶"
        
      },
      "10:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟬:𝟬𝟬 𝗔𝗠\n\n📍 𝗢𝗵𝗲 𝗞𝗶 𝗞𝗼𝗿𝗶𝗹𝗲 𝗕𝗮𝗹𝗼 𝗣𝗮𝗶𝗯𝗼 𝗧𝗼𝗺𝗮𝗿𝗲..!\n𝗥𝗮𝗸𝗵𝗶𝗯𝗼 𝗔𝗸𝗵𝗶𝘁𝗲 𝗔𝗸𝗵𝗶𝘁𝗲..?😅❤️‍🩹"
        
      },
      "11:00:00 AM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟭:𝟬𝟬 𝗔𝗠\n\n📍 𝗠𝗶𝗹𝗹𝗶𝗼𝗻 𝗳𝗲𝗲𝗹𝗶𝗻𝗴𝘀 𝗳𝗼𝗿 𝗼𝗻𝗲 𝘀𝗽𝗲𝗰𝗶𝗮𝗹\n𝗽𝗲𝗿𝘀𝗼𝗻 𝗮𝗻𝗱 𝘁𝗵𝗮𝘁 𝗶𝘀 𝗬𝗢𝗨°🙊💟"
        
      },
      "12:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟮:𝟬𝟬 𝗣𝗠\n\n📍𝗠𝗲𝗿𝗶 𝗵𝗼𝗸𝗲 𝗵𝗮𝗺𝗲𝘀𝗵𝗮 𝗵𝗶 𝗿𝗲𝗵𝗻𝗮 𝗸𝗮𝗯𝗻𝗶 𝗻𝗮\n𝗸𝗲𝗵𝗻𝗮 𝗮𝗹𝗯𝗶𝗱𝗮♡<𝟯🥺"
        
      },
      "01:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟭:𝟬𝟬 𝗣𝗠\n\n📍 𝗠𝗮𝗶𝗻𝗲 𝘁𝗲𝗿𝗮 𝗻𝗮𝗮𝗺 𝗱𝗶𝗹 𝗿𝗮𝗸𝗵 𝗱𝗶𝘆𝗮\n𝗺𝗮𝗶𝗻𝗲 𝘁𝗲𝗿𝗮 𝗻𝗮𝗮𝗺 𝗱𝗶𝗹 𝗿𝗮𝗸𝗵\n𝗱𝗶𝘆𝗮♡<𝟯"
        
      },
      "02:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟮:𝟬𝟬 𝗣𝗠\n\n📍𝗕𝗵𝗮𝗹𝗼𝗯𝗮𝘀𝗵𝗶 𝗕𝗼𝗹𝗲 𝗗𝗮𝘄 𝗔𝗺𝗮𝘆 𝗕𝗼𝗹𝗲\n𝗗𝗮𝘄 𝗛𝗲𝘆 𝗦𝗼𝗯 𝗞𝗼𝗯𝘂𝗹♡<𝟯"
        
      },
      "03:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟯:𝟬𝟬 𝗣𝗠\n\n 📍 𝗣𝗿𝗲𝗺 𝗧𝘂𝗺𝗶 𝗔𝘀𝗵𝗯𝗲 𝗘𝘃𝗮𝗯𝗲...!\n𝗔𝗯𝗮𝗿 𝗛𝗮𝗿𝗶𝘆𝗲 𝗝𝗮𝗯𝗲 𝗩𝗮𝗯𝗶𝗻𝗶♡<𝟯"
        
      },
      "04:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟰:𝟬𝟬 𝗣𝗠\n\n📍 𝗔𝗹𝗼 𝗮𝗹𝗼 𝗮𝗺𝗶 𝗞𝗵𝗼𝗸𝗼𝗻𝗼 𝗸𝘂𝗷𝗲 𝗽𝗮𝗯𝗼 𝗻𝗮\n𝗖𝗵𝗮𝗻𝗱𝗲𝗿 𝗮𝗹𝗼 𝘁𝘂𝗺𝗶 𝗸𝗵𝗼𝗸𝗼𝗻𝗼\n𝗮𝗺𝗮𝗿 𝗵𝗼𝗯𝗲 𝗻𝗮♡<𝟯"
        
      },
      "05:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟱:𝟬𝟬 𝗣𝗠\n\n📍 𝗧𝘂𝗺𝗶 𝗮𝗸𝘀𝗵𝗮𝗿 𝗯𝘂𝗸𝗲 𝗯𝗶𝘀𝗮𝗹𝘁𝗮𝗿 𝘂𝗽𝗼𝗺𝗮\n𝗧𝘂𝗺𝗶 𝗮𝗺𝗮𝗿 𝗰𝗵𝗼𝗸𝗲 𝘁𝗲\n𝘀𝗵𝗼𝗿𝗼𝘁𝗮𝗹 𝗽𝗿𝗼𝘁𝗶𝗺𝗮♡<𝟯"
        
      },
      "06:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟲:𝟬𝟬 𝗣𝗠\n\n📍 𝗦𝘂𝗻𝗻𝗮𝗿 𝗲𝗶 𝗷𝗼𝗴𝗼𝘁𝗲 𝗮𝗺𝗶 𝗮𝘀𝗰𝗶𝗹𝗮𝗺\n𝘀𝘂𝗻𝗻𝗼 𝗵𝗮𝘁𝗲 𝗽𝗮𝗶𝗻𝗶 𝗸𝗶𝗰𝘂𝗶𝗲𝗶\n𝘀𝘂𝗻𝗻𝗼𝘁𝗮 𝗰𝗵𝗮𝗿𝗮..!♡<𝟯"
        
      },
      "07:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟳:𝟬𝟬 𝗣𝗠\n\n📍 𝗔𝗺𝗶 𝘁𝗼𝗺𝗮𝗸𝗲 𝗕𝗵𝗮𝗹𝗼𝗯𝗮𝘀𝗵𝗶 𝘁𝘂𝗺𝗶 𝗽𝗮𝘀𝗵𝗮\n𝗰𝗵𝗶𝗹𝗲 𝗯𝗼𝗹𝗲 𝗯𝗮𝗰𝗵𝗲 𝗮𝗰𝗰𝗵𝗶♡<𝟯"
        
      },
      "08:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟴:𝟬𝟬 𝗣𝗠\n\n📍 𝗝𝗮𝗻𝗻𝗶 𝗮𝗯𝗲𝗿 𝗮𝗸𝘁𝗶 𝗷𝗼𝗻𝗻𝗺𝗼 𝗮𝗺𝗮𝗿 𝗸𝗼𝗯𝘂 𝗵𝗼𝗯𝗲\n𝗻𝗵\n𝗝𝗮𝗻𝗶 𝗮𝗯𝗲𝗿 𝗮𝗺𝗼𝗻 𝗸𝗼𝗿𝗲\n𝘁𝗼𝗺𝗮𝗿 𝗱𝗮𝗸𝗵𝗮 𝗽𝗮𝗯𝗼 𝗻𝗵..!♡<𝟯"
        
      },
      "09:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟬𝟵:𝟬𝟬 𝗣𝗠\n\n📍 𝗠𝗮𝗶𝗻𝗲 𝗿𝗼𝘆𝗮 𝘁𝘂𝗷𝗵𝗲 𝗱𝗵𝘂𝗻𝗱 𝗱𝗵𝘂𝗻𝗱 𝗸𝗲\n𝗥𝗼𝘆𝗮𝘁𝗵𝗮 𝗺𝗮𝗶𝗻 𝘁𝘂 𝗻𝗮 𝗺𝗶𝗹𝗮𝗮♡<𝟯"
        
      },
      "10:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟬:𝟬𝟬 𝗣𝗠\n\n📍 𝗝𝗼𝗱𝗶 𝘀𝗼𝘁𝘁𝗶 𝗷𝗮𝗻𝘁𝗲 𝗰𝗵𝗮𝘄 𝘁𝗼𝗺𝗮𝗸𝗲 𝗰𝗵𝗮𝗶\n𝘁𝗼𝗺𝗮𝗸𝗲 𝗰𝗵𝗮𝗶..!♡<𝟯"
        
      },
      "11:00:00 PM": {
        message: "🔔 𝗔𝘂𝘁𝗼𝗧𝗶𝗺𝗲:\n━━━━━━━━━━━━━━━━━\n⏰ 𝗧𝗶𝗺𝗲 𝗡𝗼𝘄 - 𝟭𝟭:𝟬𝟬 𝗣𝗠\n\n📍 𝗡𝗶𝗯𝗶𝗿 𝗢𝗻𝗱𝗼𝗸𝗮𝗿𝗲 𝗖𝗵𝗶𝘁𝗶𝗿 𝗕𝗶𝗰𝗵𝗼𝗿𝗼𝗻 𝗕𝗵𝗮𝘃𝗲\n𝗝𝗮𝗶 𝗧𝗼𝗺𝗮𝗸𝗲 𝗡𝗶𝗿𝗹𝗼𝗷𝗼 𝗮 𝗺𝗼𝗻..!♡<𝟯"
      }

    // Add more messages for other times as needed
  };

  const checkTimeAndSendMessage = () => {
    const now = moment().tz('Asia/Dhaka');
    const currentTime = now.format('hh:mm:ss A');

    const messageData = arrayData[currentTime];

    if (messageData) {
      const tid = global.db.allThreadData.map(i => i.threadID);
      tid.forEach(async (threadID, index) => {
        api.sendMessage({ body: messageData.message }, threadID);
      });
    }

    const nextMinute = moment().add(1, 'minute').startOf('minute');
    const delay = nextMinute.diff(moment());
    setTimeout(checkTimeAndSendMessage, delay);
  };

  checkTimeAndSendMessage();
  
};

module.exports.onStart = () => {};
